## staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_log_metric_filter.celery-error[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "celery-error" {
        id             = "celery-error"
        name           = "celery-error"
      ~ pattern        = "%ERROR/.*Worker|ERROR/MainProcess%" -> "%ERROR/.*Worker% OR %ERROR/MainProcess% -(%Failed to write metrics to the socket due to socket%)"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_metric_filter.socket-error[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "socket-error" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name           = "socket-error"
      + pattern        = "%Failed to write metrics to the socket due to socket%"

      + metric_transformation {
          + name      = "celery-critical"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.logs-1-socket-error-1-minute-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-socket-error-1-minute-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One socket error in 1 minute"
      + alarm_name                            = "logs-1-socket-error-1-minute-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-critical"
      + namespace                             = "LogMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-10-celery-error-1-minute-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-10-celery-error-1-minute-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Ten Celery errors in 1 minute"
      + alarm_name                            = "logs-10-celery-error-1-minute-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-critical"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Error: Invalid import id argument

  on cloudwatch_log.tf line 7, in import:
   7:   id = "arn:aws:logs:ca-central-1:${var.subscription_id}:log-group:/aws/containerinsights/${var.eks_cluster_name}/host:*"

The import block "id" argument depends on resource attributes that cannot be
determined until apply, so Terraform cannot plan to import this resource.

Error: Reference to undeclared input variable

  on cloudwatch_log.tf line 7, in import:
   7:   id = "arn:aws:logs:ca-central-1:${var.subscription_id}:log-group:/aws/containerinsights/${var.eks_cluster_name}/host:*"

An input variable with the name "subscription_id" has not been declared. This
variable can be declared with a variable "subscription_id" {} block.
time=2025-04-03T18:47:25Z level=error msg=terraform invocation failed in /home/runner/work/notification-terraform/notification-terraform/env/staging/eks/.terragrunt-cache/T-kwq0KEw80xJwS_HVsuQ8gZoSA/ziUKr5pa_JoeDZ3wgSbieuIpHJE/eks error=[/home/runner/work/notification-terraform/notification-terraform/env/staging/eks/.terragrunt-cache/T-kwq0KEw80xJwS_HVsuQ8gZoSA/ziUKr5pa_JoeDZ3wgSbieuIpHJE/eks] exit status 1 prefix=[/home/runner/work/notification-terraform/notification-terraform/env/staging/eks] 
time=2025-04-03T18:47:25Z level=error msg=1 error occurred:
	* [/home/runner/work/notification-terraform/notification-terraform/env/staging/eks/.terragrunt-cache/T-kwq0KEw80xJwS_HVsuQ8gZoSA/ziUKr5pa_JoeDZ3wgSbieuIpHJE/eks] exit status 1



```

</details>

